app/controllers/articles_controller.rb

  def edit
    @article = Article::find(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]