app/controllers/welcome_controller.rb

SELECT `products`.* FROM `products`  WHERE `products`.`name` = 'pad'  ORDER BY created_at desc
---
  def ac
    #p = Product.new
    #p.name = "Some Book"
    #p.save
    #Product.create(name:"pad")


    #all = Product.all

    #product = Product.first
    #product = Product.find_by(name:"pad")
    product = Product.where(name:"pad").order("created_at desc")